---
kind: property
id: P:Autodesk.Revit.DB.LineSegment.StartPoint
source: html/63de5878-c194-2219-8463-c656325af84a.htm
---
# Autodesk.Revit.DB.LineSegment.StartPoint Property

Start point of the line segment.

## Syntax (C#)
```csharp
public XYZ StartPoint { get; }
```